MHz = 10 ** 6  # 1 МГц
GHz = 10 ** 9  # 1 ГГц

mks = 1e-6  # 1 мкс

resonance_frequency = 21.506 * GHz  # Rb 85

# МОДЕЛЬ ТАВИСА-КАММИНГСА С 2 ГРУППАМИ АТОМОВ ПО n ЭЛЕМЕНТОВ В КАЖДОЙ, ГДЕ ИЗУЧАЮТСЯ ОСЦИЛЛЯЦИИ МЕЖДУ ВОЗБУЖДЕННЫМИ СОСТОЯНИЯМИ ОДНОЙ ГРУППЫ И ДРУГОЙ
# ЛИНДБЛАД
# ВЫЧИСЛЕНИЕ И ПОСТРОЕНИЕ ГРАФИКОВ ПРОИЗВОДИТСЯ В ВЫЧИСЛИТЕЛЬНОМ БАЗИСЕ
# АТОМЫ НУМЕРУЮТСЯ, НАЧИНАЯ С 0; В БАЗИСНОМ СОСТОЯНИИ - СПРАВА НАЛЕВО
#
# capacity - полная энергия полости
# n - количество атомов в группе (общее число атомов - 2*n)
# wc - cavity frequency (Hz)
# wa - atomic transition frequency (Hz)
# g - vacuum Rabi frequency which characterizes to the photon-atom interaction strength (Hz)
#
# T - время (мкс)
# dt - временной шаг (мкс)
# nt - число шагов по времени
#
# init_state - произвольное начальное состояние
#
# Пример:
# 	capacity = 8
# 	init_state = [5, [0, 0, 0, 1, 1, 1]]
#   в полости 5 фотонов в фоковском состоянии |5>
# 	первая группа атомов |000> - в основном состоянии
# 	вторая группа атомов |111> - в возбужденном состоянии

# BEGIN--------------------------------------------------- CAVITY -----------------------------------------------------
capacity = 4
n_1 = 4
n_2 = 4

wc_1 = resonance_frequency
wc_2 = resonance_frequency

wa_1 = [resonance_frequency] * n_1
wa_2 = [resonance_frequency] * n_2

g_1 = [resonance_frequency / 100] * n_1
g_2 = [resonance_frequency / 100] * n_2

# END----------------------------------------------------- CAVITY -----------------------------------------------------


# mu = 506000.0
mu = g_1[0] * 4
# mu = 0

# ---------------------------------------------------------------------------------------------------------------------
T = 1 * mks
dt = T / 1000

nt = int(T / dt)
# ---------------------------------------------------------------------------------------------------------------------


init_state = [
    [capacity - n_2, [0] * n_2],
    [0, [1] * n_2]
]

precision = 5


# ---------------------------------------------------------------------------------------------------------------------
# Относительные пути файлов вывода для построения графика
path = "Bipartite2General/out/" + \
    str(capacity) + "_" + str(n_1) + "_" + str(n_2) + "/"
H_csv = path + "H.csv"
U_csv = path + "U.csv"
ro_0_csv = path + "ro_0.csv"
x_csv = path + "x.csv"
y_csv = path + "t.csv"
z_csv = path + "z.csv"
z_all_csv = path + "z_all.csv"
fid_csv = path + "fid.csv"
# ---------------------------------------------------------------------------------------------------------------------
